case_isolated/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name 	turbine;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 ( -5 0 0);
            p2 (  5 0 0);
            radius 75; 
        }
    }

 //  {
 //      name 	turbine;
 //      type	cellSet;
 //      action	add;
 //      source	cylinderToCell;
 //      sourceInfo
 //      {
 //          type cylinder; 
 //          p1 (10 0 -90);
 //          p2 (10 0   0);
 //          radius 10;
 //      }
 //  }

    {
        name    turbine;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine;
        }
    }
);

// ************************************************************************* //
